tinic/lathe_motion_stm32/lathe_motion/src/main.cpp
#define USART_BAUD 115200
#define USART_BUFFER_SIZE 128

static void put_char(uint8_t byte)
{
    USART1->DR = (int)(byte);
    while (!(USART1->SR & USART_SR_TXE));
}

typedef struct {
    uint8_t buffer[USART_BUFFER_SIZE];
    uint8_t head_pos;
    uint8_t tail_pos;
} rx_buffer_t;

volatile rx_buffer_t uart_buffer = { { 0 }, 0, 0 };

static void buffer_char(uint8_t c)
{
    __disable_irq();

    int i = (uart_buffer.head_pos + 1) % USART_BUFFER_SIZE;
    
    if (i != uart_buffer.tail_pos) {
        uart_buffer.buffer[uart_buffer.head_pos] = c;
        uart_buffer.head_pos = i;
    }

    __enable_irq();
}

static uint8_t get_char(uint8_t *c)
{
    __disable_irq();

    if(uart_buffer.head_pos == uart_buffer.tail_pos) {
        __enable_irq();
        return 0;
    }
    
    *c = uart_buffer.buffer[uart_buffer.tail_pos];
    uart_buffer.tail_pos = (uart_buffer.tail_pos + 1) % USART_BUFFER_SIZE;
    
    __enable_irq();
    return 1;
}

volatile uint32_t *DWT_CYCCNT = (uint32_t *)0xE0001004;

static void parse(void);
static void set_current_run_mode(run_mode mode);

#ifdef __cplusplus
extern "C" {
#endif  // #ifdef __cplusplus

void HardFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void BusFault_Handler(void)
{
    for (;;) {
        LED_PORT->BSRR  = LED_RESET;
    }
}

void SysTick_Handler(void)
{
    absolute_tick++;
    
    parse();

    led_delay_count = ( (led_delay_count + 1) % LED_DELAY_MS );
    if(led_delay_count == 0) {
        led_state       = led_state_next;
        led_state_next  = led_idle;
    }
    
    IWDG->KR  = 0xAAAA;
}

void USART1_IRQHandler(void)
{
    uint8_t in_char = (USART1->DR & 0xFF);
    buffer_char(in_char);
}

void EXTI1_IRQHandler(void)
{
    // Core critical section, nothing shall happen here
    __disable_irq();
    int16_t cnt = TIM3->CNT;
    TIM3->CNT = 0;

    absolute_pos += cnt;

    if (cnt < 0) {
        absolute_idx--;
    } else {
        absolute_idx++;
    }

    EXTI->PR |= EXTI_PR_PR1;

    if (cnt == 2880 || cnt == -2880) {
        index_zero_occured = 1;
    }

    static int32_t last_absolute_tick = 0;
    current_index_delta = abs(absolute_tick - last_absolute_tick);
    last_absolute_tick = absolute_tick;
    __enable_irq();
}

void TIM2_IRQHandler(void)
{
    static int32_t stepper_dir_z = 0; // direction is undefined by default
    static int32_t stepper_dir_x = 0; // direction is undefined by default
    static int32_t stepper_dir_d = 0; // direction is undefined by default

    if ((TIM2->SR & TIM_SR_UIF)) {
        TIM2->SR &= ~(TIM_SR_UIF);

        *DWT_CYCCNT = 0;

        // Do nothing if we are in stop sync mode
        if (current_run_mode == run_mode_none ||
            current_run_mode == run_mode_idle) {
            return;
        }
        
        // Protect against TIM3 IRQ race
        __disable_irq();
        int16_t cnt = TIM3->CNT;
        int32_t absolute_actual_pos = absolute_pos;

        absolute_actual_pos += cnt - absolute_pos_start_offset;

        if (wait_for_index_zero) {
            if (index_zero_occured) {
                index_zero_occured = 0;
                wait_for_index_zero = 0;
                absolute_pos_start_offset = cnt;
                absolute_pos = 0;
                absolute_actual_pos = 0;
                stepper_off_z = stepper_actual_pos_z;
                stepper_off_x = stepper_actual_pos_x;
                stepper_off_d = stepper_actual_pos_d;
            } else {
                // Do nothing until we hit index zero
                __enable_irq();
                return;
            }
        }
        __enable_irq();

        static uint32_t flip_z = 0;
        static uint32_t flip_x = 0;
        static uint32_t flip_d = 0;

		int32_t stepper_target_pos_z = stepper_actual_pos_z;
		int32_t stepper_target_pos_x = stepper_actual_pos_x;
		int32_t stepper_target_pos_d = stepper_actual_pos_d;

		switch (current_run_mode) {
			case    run_mode_follow_zxd: {
						if (flip_z) {
                            if (stepper_follow_mul_z == 0) {
							    stepper_target_pos_z = stepper_off_z;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_z);
							    int32_t v = stepper_follow_div_z;
							    stepper_target_pos_z = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_z += stepper_off_z;
                            }
						}
						
						if (flip_x) {
                            if (stepper_follow_mul_x == 0) {
							    stepper_target_pos_x = stepper_off_x;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_x);
							    int32_t v = stepper_follow_div_x;
							    stepper_target_pos_x = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_x += stepper_off_x;
                            }
						}
						
						if (flip_d) {
                            if (stepper_follow_mul_d == 0) {
							    stepper_target_pos_d = stepper_off_d;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_d);
							    int32_t v = stepper_follow_div_d;
							    stepper_target_pos_d = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_d += stepper_off_d;
                            }
						}
					} break;
			case    run_mode_follow_z: {
						if (flip_z) {
                            if (stepper_follow_mul_z == 0) {
							    stepper_target_pos_z = stepper_off_z;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_z);
							    int32_t v = stepper_follow_div_z;
							    stepper_target_pos_z = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_z += stepper_off_z;
                            }
						}
					} break;
			case    run_mode_follow_x: {
						if (flip_x) {
                            if (stepper_follow_mul_x == 0) {
							    stepper_target_pos_x = stepper_off_x;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_x);
							    int32_t v = stepper_follow_div_x;
							    stepper_target_pos_x = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_x += stepper_off_x;
                            }
						}
					} break;
			case    run_mode_follow_d: {
						if (flip_d) {
                            if (stepper_follow_mul_d == 0) {
							    stepper_target_pos_d = stepper_off_d;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(stepper_follow_mul_d);
							    int32_t v = stepper_follow_div_d;
							    stepper_target_pos_d = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_d += stepper_off_d;
                            }
						}
					} break;
			case    run_mode_cycle_pause:
			case    run_mode_cycle: {
						const cycle_entry &e = current_cycle[current_cycle_idx];

						if (flip_z) {
                            if (e.stepper_mul_z == 0) {
							    stepper_target_pos_z = stepper_off_z;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(e.stepper_mul_z);
							    int32_t v = e.stepper_div_z;
							    stepper_target_pos_z = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_z += stepper_off_z;      
                            }
						}
						
						if (flip_x) {
                            if (e.stepper_mul_x == 0) {
							    stepper_target_pos_x = stepper_off_x;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(e.stepper_mul_x);
							    int32_t v = e.stepper_div_x;
							    stepper_target_pos_x = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_x += stepper_off_x;
                            }
						}
						
						if (flip_d) {
                            if (e.stepper_mul_d == 0) {
							    stepper_target_pos_d = stepper_off_d;      
                            } else {
							    int64_t u = int64_t(absolute_actual_pos) * int64_t(e.stepper_mul_d);
							    int32_t v = e.stepper_div_d;
							    stepper_target_pos_d = divls(int32_t(u>>32),uint32_t(u), v); 
							    stepper_target_pos_d += stepper_off_d;
                            }
						}

